app/Controllers/API/PostAPIController.php

SELECT `id`, `title`, date_format(published_time, '%Y-%m-%d') as published_time, `is_active`
FROM `posts`
---
    public function list()
    {
        $respData = [];
        $respCode = Response::HTTP_OK;
        try
        {
            $data = $this->postModel->select(
                'id, title, date_format(published_time, \'%Y-%m-%d\') as published_time, is_active'
            )->findAll();