app/Controllers/API/PublicationAPIController.php

SELECT `id`, `title`, `is_active`, date_format(published_time, "%Y-%m-%d") as published_time
FROM `publications`
SELECT COUNT(`id`) AS `id`
FROM `publications`
 LIMIT 1
---
    public function list()
    {
        $respData = [];
        $respCode = Response::HTTP_OK;
        try
        {
            $fromUnity = filter_var($this->request->getHeaderLine('X-Unity-Req'), FILTER_VALIDATE_BOOL);

            $data = $this->pubModel->select(
                'publications.id, title, is_active, date_format(published_time, "%Y-%m-%d") as published_time, date_format(publications.created_at, "%Y-%m-%d") as created_at, display_name as created_by'
            )
            ->join('users', 'users.id = publications.created_by')
            // Only returning active publication if the request is from unity
            ->where($fromUnity ? 'is_active' : 'publications.id >=' , 1)
            ->findAll();

            if(!$fromUnity)
            {
                $data['data'] = $data;
                $data['total'] = $this->pubModel->selectCount('id')->first()['id'];